app/Controllers/DataSekolah.php

    public function identitas()
    {
        $data = $this->sekolah->findAll();
---
SELECT *
FROM `tb_sekolah`

    public function tahun_ajaran()
    {
        $data = $this->tahun_ajaran->select('tahun_ajaran_id, nama')->findAll();
---
SELECT `tahun_ajaran_id`, `nama`
FROM `tb_tahun_ajaran`