app/Controllers/Kelas.php

SELECT `tb_kelas`.`kelas_id`, `tb_kelas`.`kelas_nama`, `tb_kelas`.`kelas_jurusan`, COUNT(tb_siswa.siswa_id) as jumlah_siswa
FROM `tb_kelas`
LEFT JOIN `tb_siswa` ON `tb_siswa`.`siswa_kelas` = `tb_kelas`.`kelas_id`
GROUP BY `tb_kelas`.`kelas_id`
---
    public function index()
    {
        $kelas = new \App\Models\KelasModel();

        $sum_siswa = $kelas->select('tb_kelas.kelas_id, tb_kelas.kelas_nama, tb_kelas.kelas_jurusan,COUNT(tb_siswa.siswa_id) as jumlah_siswa')
            ->join('tb_siswa', 'tb_siswa.siswa_kelas = tb_kelas.kelas_id', 'left')
            ->groupBy('tb_kelas.kelas_id')
            ->findAll();