app/Controllers/P5bk.php

SELECT `elemen`.`id_elemen`, `elemen`.`nama_elemen`, `sub_elemen`.`id`, `sub_elemen`.`nama_sub_elemen`, `sub_elemen`.`capaian`
FROM `elemen`
JOIN `sub_elemen` ON `elemen`.`id_elemen` = `sub_elemen`.`elemen_id`
WHERE `elemen`.`dimensi_id` = '2'
---
    public function capaian()
    {

        $id = $this->request->uri->getSegment(3);
        $db  = $this->db;
        $builder = $db->table('elemen');
        $builder->select('elemen.id_elemen, elemen.nama_elemen, sub_elemen.id, sub_elemen.nama_sub_elemen, sub_elemen.capaian');
        $builder->join('sub_elemen', 'elemen.id_elemen = sub_elemen.elemen_id');
        $builder->where('elemen.dimensi_id', $id);
        $query = $builder->get()->getResult();