app/Controllers/P5bk.php

SELECT `rencana_budaya_kerja`.`rencana_id`, `rencana_budaya_kerja`.`nama`, `rencana_budaya_kerja`.`deskripsi`, `tb_kelas`.`kelas_id`, `tb_kelas`.`kelas_nama`, COUNT(aspek_penilaian.dimensi_id) as dimensi
FROM `rencana_budaya_kerja`
JOIN `tb_kelas` ON `tb_kelas`.`kelas_id` = `rencana_budaya_kerja`.`kelas_id`
JOIN `aspek_penilaian` ON `aspek_penilaian`.`rencana_id` = `rencana_budaya_kerja`.`rencana_id`
GROUP BY `rencana_budaya_kerja`.`rencana_id`
SELECT *
FROM `tb_kelas`
---
    public function index()
    {

        $db  = $this->db;
        $builder = $db->table('rencana_budaya_kerja');
        $builder->join('tb_kelas', 'tb_kelas.kelas_id = rencana_budaya_kerja.kelas_id');
        $builder->join('aspek_penilaian', 'aspek_penilaian.rencana_id = rencana_budaya_kerja.rencana_id');
        $builder->select('rencana_budaya_kerja.rencana_id,rencana_budaya_kerja.nama, rencana_budaya_kerja.deskripsi,');
        $builder->select('tb_kelas.kelas_id,tb_kelas.kelas_nama');
        $builder->select('COUNT(aspek_penilaian.dimensi_id) as dimensi');
        $builder = $builder->groupBy('rencana_budaya_kerja.rencana_id');
        $query = $builder->get()->getResultarray();

        $get_kelas = $this->KelasModel->findAll();

SELECT `elemen`.`id_elemen`, `elemen`.`nama_elemen`, `sub_elemen`.`id`, `sub_elemen`.`nama_sub_elemen`, `sub_elemen`.`capaian`
FROM `elemen`
JOIN `sub_elemen` ON `elemen`.`id_elemen` = `sub_elemen`.`elemen_id`
WHERE `elemen`.`dimensi_id` = ''
---
    public function capaian()
    {

        $id = $this->request->uri->getSegment(3);
        $db  = $this->db;
        $builder = $db->table('elemen');
        $builder->select('elemen.id_elemen, elemen.nama_elemen, sub_elemen.id, sub_elemen.nama_sub_elemen, sub_elemen.capaian');
        $builder->join('sub_elemen', 'elemen.id_elemen = sub_elemen.elemen_id');
        $builder->where('elemen.dimensi_id', $id);
        $query = $builder->get()->getResult();