app/Controllers/Siswa.php

    public function index()
    {

        $data = [
            'title' => 'Data Siswa',
            'active' => 'data_siswa',
            'siswa' => $this->siswaModel->findAll(),
        ];
---
SELECT *
FROM `tb_siswa`