app/Controllers/Test.php

    public function index()
    {
        $db = Database::connect();

        $kelas = $this->request->getVar('kelas');
        //get input from url segment 3
        $projek = $this->request->getVar('projek');

        //get all rencana
        $rencana = $db->table('rencana_budaya_kerja');
        $kueri2 = $rencana->select('rencana_id,nama');
        $kueri2 = $rencana->where('kelas_id', $kelas);
        $kueri2 = $rencana->get()->getResultArray();

        $pilih = $db->table('tb_kelas');
        $pilih->select('kelas_nama');
        $pilih->where('kelas_id', $kelas);
        $kueri3 = $pilih->get()->getRowArray();

        $kls = $db->table('tb_kelas');
        $kueri = $kls->select('kelas_id,kelas_nama');
        $kueri = $kls->get()->getResultArray();

        $p1 = $db->table('aspek_penilaian');
        $p1->select('aspek_penilaian.dimensi_id,aspek_penilaian.aspek_id,aspek_penilaian.rencana_id,dimensi.nama_dimensi');
        $p1->join('dimensi', 'dimensi.id_dimensi = aspek_penilaian.dimensi_id');
        $p1->where('rencana_id', $projek);
        //data dimensi
        $ka = $p1->get()->getResultArray();
---
SELECT `rencana_id`, `nama`
FROM `rencana_budaya_kerja`
WHERE `kelas_id` IS NULL
SELECT `kelas_nama`
FROM `tb_kelas`
WHERE `kelas_id` IS NULL
SELECT `kelas_id`, `kelas_nama`
FROM `tb_kelas`
SELECT *
FROM `dimensi`
SELECT `aspek_penilaian`.`dimensi_id`, `aspek_penilaian`.`aspek_id`, `aspek_penilaian`.`rencana_id`, `dimensi`.`nama_dimensi`
FROM `aspek_penilaian`
JOIN `dimensi` ON `dimensi`.`id_dimensi` = `aspek_penilaian`.`dimensi_id`
WHERE `rencana_id` IS NULL

        $p3 = $db->table('opsi_penilaian');
        $p3->select('opsi_penilaian.opsi_id,opsi_penilaian.kode_opsi');
        //data opsi
        $opsi = $p3->get()->getResultArray();
---
SELECT `opsi_penilaian`.`opsi_id`, `opsi_penilaian`.`kode_opsi`
FROM `opsi_penilaian`

        $p5 = $db->table('rencana_budaya_kerja');
        $p5->select('rencana_budaya_kerja.nama');
        $p5->where('rencana_id', $projek);
        $pilih2 = $p5->get()->getRowArray();
---
SELECT `rencana_budaya_kerja`.`nama`
FROM `rencana_budaya_kerja`
WHERE `rencana_id` IS NULL