app/Models/AspekModel.php

    public function getAllaspek()
    {
        //get aspek
        $aspek = $this->db->table('aspek_penilaian');
        $aspek = $aspek->get()->getResultArray();
---
SELECT *
FROM `aspek_penilaian`