app/Models/CatatanModel.php

    public function getCatatanbysiswa()
    {
        $db = \Config\Database::connect();
        $catatan = $db->table('catatan');
        $catatan = $catatan->select('catatan.*, tb_siswa.siswa_id');
        $catatan = $catatan->join('tb_siswa', 'tb_siswa.siswa_id = catatan.siswa_id');

        $catatan = $catatan->get()->getResultArray();
---
SELECT `catatan`.*, `tb_siswa`.`siswa_id`
FROM `catatan`
JOIN `tb_siswa` ON `tb_siswa`.`siswa_id` = `catatan`.`siswa_id`

    public function getCatatanbyidsiswa($id)
    {
        $db = \Config\Database::connect();
        $catatan = $db->table('catatan');
        $catatan = $catatan->select('catatan.*, tb_siswa.siswa_id');
        $catatan = $catatan->join('tb_siswa', 'tb_siswa.siswa_id = catatan.siswa_id');
        $catatan = $catatan->where('catatan.siswa_id', $id);
        $catatan = $catatan->get()->getResultArray();
---
SELECT `catatan`.*, `tb_siswa`.`siswa_id`
FROM `catatan`
JOIN `tb_siswa` ON `tb_siswa`.`siswa_id` = `catatan`.`siswa_id`
WHERE `catatan`.`siswa_id` = '1'