app/Models/DimensiModel.php

SELECT `elemen`.`id_elemen`, `elemen`.`dimensi_id`, `elemen`.`nama_elemen`, `elemen`.`elemen_deskripsi`
FROM `elemen`
---
    public function getElemen()
    {
        //get name dimensi
        $elm = $this->db->table('elemen');
        $elm->select('elemen.id_elemen,elemen.dimensi_id, elemen.nama_elemen, elemen.elemen_deskripsi');
        $elm = $elm->get()->getResultArray();