app/Models/KelasModel.php

SELECT *
FROM `tb_kelas`
---
    public function getAllkelas()
    {
        return $this->findAll();