app/Models/NilaiP5bk.php

SELECT `nilai_p5bk`.*, `tb_siswa`.`siswa_nama`
FROM `nilai_p5bk`
JOIN `tb_siswa` ON `tb_siswa`.`siswa_id` = `nilai_p5bk`.`siswa_id`
SELECT `tb_siswa`.`siswa_nama`, `tb_siswa`.`siswa_id`
FROM `tb_siswa`
JOIN `nilai_p5bk` ON `nilai_p5bk`.`siswa_id` = `tb_siswa`.`siswa_id`
GROUP BY `tb_siswa`.`siswa_id`
---
    public function getAllNilai()
    {
        $db = \Config\Database::connect();
        $nilai = $db->table('tb_siswa');
        $nilai->select('tb_siswa.siswa_nama,tb_siswa.siswa_id');
        $nilai->join('nilai_p5bk', 'nilai_p5bk.siswa_id = tb_siswa.siswa_id');
        $nilai->groupBy('tb_siswa.siswa_id');

        return $nilai->get()->getResultArray();

SELECT `nilai_p5bk`.`dimensi_id`, `nilai_p5bk`.`rencana_id`, `nilai_p5bk`.`rencana_id`, `nilai_p5bk`.`elemen_id`, `nilai_p5bk`.`opsi_id`
FROM `nilai_p5bk`
WHERE `nilai_p5bk`.`siswa_id` = '1'
---
    public function getNilai($id_siswa)
    {
        //get data nilai dimensi
        $kueri_nilai = $this->db->table('nilai_p5bk');
        $kueri_nilai->select('nilai_p5bk.dimensi_id,nilai_p5bk.rencana_id,nilai_p5bk.rencana_id,nilai_p5bk.elemen_id,nilai_p5bk.opsi_id');
        $kueri_nilai->where('nilai_p5bk.siswa_id', $id_siswa);
        $nilai = $kueri_nilai->get()->getResultArray();

SELECT `catatan`.`catatan`
FROM `catatan`
WHERE `catatan`.`siswa_id` = '1'
---
    public function catatan($id_siswa)
    {
        //get catatan
        $catatan = $this->db->table('catatan');
        $catatan->select('catatan.catatan');
        $catatan->where('catatan.siswa_id', $id_siswa);
        return $catatan->get()->getRowArray();