app/Models/PenilaianModel.php

SELECT `tb_kelas`.`kelas_id`, `tb_kelas`.`kelas_nama`, `rencana_budaya_kerja`.`nama`, `rencana_budaya_kerja`.`rencana_id`, `aspek_penilaian`.`aspek_id`
FROM `tb_kelas`
JOIN `rencana_budaya_kerja` ON `rencana_budaya_kerja`.`kelas_id` = `tb_kelas`.`kelas_id`
JOIN `aspek_penilaian` ON `aspek_penilaian`.`rencana_id` = `rencana_budaya_kerja`.`rencana_id`
WHERE `rencana_budaya_kerja`.`rencana_id` = '1'
SELECT `tb_kelas`.`kelas_id`, `tb_kelas`.`kelas_nama`, `rencana_budaya_kerja`.`nama`, `rencana_budaya_kerja`.`rencana_id`
FROM `tb_kelas`
JOIN `rencana_budaya_kerja` ON `rencana_budaya_kerja`.`kelas_id` = `tb_kelas`.`kelas_id`
WHERE `rencana_budaya_kerja`.`rencana_id` IS NULL
---
    public function getPilihan($projek)
    {
        $db = \Config\Database::connect();
        $p1 = $db->table('tb_kelas');
        $p1->select('tb_kelas.kelas_id,tb_kelas.kelas_nama,rencana_budaya_kerja.nama,rencana_budaya_kerja.rencana_id ,aspek_penilaian.aspek_id');
        $p1->join('rencana_budaya_kerja', 'rencana_budaya_kerja.kelas_id = tb_kelas.kelas_id');
        $p1->join('aspek_penilaian', 'aspek_penilaian.rencana_id = rencana_budaya_kerja.rencana_id');
        $p1->where('rencana_budaya_kerja.rencana_id', $projek);
        $p1 = $p1->get()->getResultArray();
        $p1 = array_map(function ($p1) {
            return [
                'kelas_id' => $p1['kelas_id'],
                'nama_kelas' => $p1['kelas_nama'],
                'nama_projek' => $p1['nama'],
                'projek_id' => $p1['rencana_id'],
                'aspek_id' => $p1['aspek_id'],
            ];
        }, $p1);
        //if array is empty, find kelas_nama where $projek
        if (empty($p1)) {
            $p1 = $db->table('tb_kelas');
            $p1->select('tb_kelas.kelas_id,tb_kelas.kelas_nama,rencana_budaya_kerja.nama,rencana_budaya_kerja.rencana_id');
            $p1->join('rencana_budaya_kerja', 'rencana_budaya_kerja.kelas_id = tb_kelas.kelas_id');
            $p1->where('rencana_budaya_kerja.rencana_id', $projek);
            $p1 = $p1->get()->getResultArray();

SELECT `rencana_budaya_kerja`.`rencana_id`, `rencana_budaya_kerja`.`nama`, `tb_kelas`.`kelas_nama`
FROM `rencana_budaya_kerja`
JOIN `tb_kelas` ON `tb_kelas`.`kelas_id` = `rencana_budaya_kerja`.`kelas_id`
WHERE `rencana_budaya_kerja`.`kelas_id` IS NULL
---
    public function getProjek($kelas)
    {
        $db = \Config\Database::connect();
        $p1 = $db->table('rencana_budaya_kerja');
        $p1->select('rencana_budaya_kerja.rencana_id,rencana_budaya_kerja.nama,tb_kelas.kelas_nama');
        $p1->join('tb_kelas', 'tb_kelas.kelas_id = rencana_budaya_kerja.kelas_id');
        $p1->where('rencana_budaya_kerja.kelas_id', $kelas);
        $p1 = $p1->get()->getResultArray();

SELECT `aspek_penilaian`.`dimensi_id`, `aspek_penilaian`.`aspek_id`, `aspek_penilaian`.`rencana_id`, `dimensi`.`nama_dimensi`
FROM `aspek_penilaian`
JOIN `dimensi` ON `dimensi`.`id_dimensi` = `aspek_penilaian`.`dimensi_id`
WHERE `rencana_id` = '1'
---
    public function getAspek($projek)
    {
        $db = \Config\Database::connect();
        $p1 = $db->table('aspek_penilaian');
        $p1->select('aspek_penilaian.dimensi_id,aspek_penilaian.aspek_id,aspek_penilaian.rencana_id,dimensi.nama_dimensi');
        $p1->join('dimensi', 'dimensi.id_dimensi = aspek_penilaian.dimensi_id');
        $p1->where('rencana_id', $projek);
        $p1 = $p1->get()->getResultArray();

SELECT `tb_siswa`.`siswa_id`, `tb_siswa`.`siswa_nama`
FROM `tb_siswa`
JOIN `rencana_budaya_kerja` ON `rencana_budaya_kerja`.`kelas_id` = `tb_siswa`.`siswa_kelas`
WHERE `rencana_id` = '1'
---
    public function getSiswa($projek)
    {
        $db = \Config\Database::connect();
        $p4 = $db->table('tb_siswa');
        //get siswa by siswa_kelas from rencana_budaya_kerja where rencana_id = $projek
        $p4->select('tb_siswa.siswa_id,tb_siswa.siswa_nama');
        $p4->join('rencana_budaya_kerja', 'rencana_budaya_kerja.kelas_id = tb_siswa.siswa_kelas');
        //kelas nama

        $p4->where('rencana_id', $projek);
        //data siswa
        $siswa = $p4->get()->getResultArray();

SELECT `elemen`.`id_elemen`, `elemen`.`nama_elemen`, `elemen`.`dimensi_id`, `dimensi`.`nama_dimensi`
FROM `elemen`
JOIN `aspek_penilaian` ON `aspek_penilaian`.`dimensi_id` = `elemen`.`dimensi_id`
JOIN `dimensi` ON `dimensi`.`id_dimensi` = `elemen`.`dimensi_id`
WHERE `aspek_penilaian`.`rencana_id` = '1'
AND `rencana_id` = '1'
---
    public function getElemen($projek)
    {
        $db = \Config\Database::connect();
        $p2 = $db->table('elemen');
        $p2->select('elemen.id_elemen,elemen.nama_elemen,elemen.dimensi_id,dimensi.nama_dimensi');
        $p2->join('aspek_penilaian', 'aspek_penilaian.dimensi_id = elemen.dimensi_id');
        $p2->join('dimensi', 'dimensi.id_dimensi = elemen.dimensi_id');
        $p2->where('aspek_penilaian.rencana_id', $projek);
        $p2->where('rencana_id', $projek);
        //data elemen
        $ka2 = $p2->get()->getResultArray();