app/Models/ProjectModel.php

    public function getProjecbykelas($kelas_id)
    {
        //get data rencana
        $rencana = $this->db->table('rencana_budaya_kerja');
        $rencana = $rencana->select('rencana_budaya_kerja.rencana_id,rencana_budaya_kerja.nama, rencana_budaya_kerja.deskripsi');
        $rencana = $rencana->where('rencana_budaya_kerja.kelas_id', $kelas_id);
        $rencana = $rencana->get()->getResultArray();
---
SELECT `rencana_budaya_kerja`.`rencana_id`, `rencana_budaya_kerja`.`nama`, `rencana_budaya_kerja`.`deskripsi`
FROM `rencana_budaya_kerja`
WHERE `rencana_budaya_kerja`.`kelas_id` = '1'