app/Models/SekolahModel.php

    public function getsekolah()
    {
        $sekolah = $this->db->table('tb_sekolah');
        $sekolah = $sekolah->select('tb_sekolah.*');
        $sekolah = $sekolah->get()->getRowArray();
---
SELECT `tb_sekolah`.*
FROM `tb_sekolah`