app/Models/SiswaModel.php

    public function getSiswabyId($id_siswa)
    {
        $siswa = $this->db->table('tb_siswa');
        $siswa = $siswa->select('tb_siswa.siswa_id, tb_siswa.siswa_nama, tb_siswa.siswa_nis, tb_siswa.siswa_nisn, tb_siswa.siswa_jk, tb_siswa.siswa_tempat_lahir, tb_siswa.siswa_tanggal_lahir, tb_siswa.siswa_agama, tb_siswa.siswa_alamat, tb_siswa.siswa_kelas, tb_kelas.kelas_nama');
        $siswa = $siswa->join('tb_kelas', 'tb_kelas.kelas_id = tb_siswa.siswa_kelas');
        $siswa = $siswa->where('tb_siswa.siswa_id', $id_siswa);
        $siswa = $siswa->get()->getRowArray();
---
SELECT `tb_siswa`.`siswa_id`, `tb_siswa`.`siswa_nama`, `tb_siswa`.`siswa_nis`, `tb_siswa`.`siswa_nisn`, `tb_siswa`.`siswa_jk`, `tb_siswa`.`siswa_tempat_lahir`, `tb_siswa`.`siswa_tanggal_lahir`, `tb_siswa`.`siswa_agama`, `tb_siswa`.`siswa_alamat`, `tb_siswa`.`siswa_kelas`, `tb_kelas`.`kelas_nama`
FROM `tb_siswa`
JOIN `tb_kelas` ON `tb_kelas`.`kelas_id` = `tb_siswa`.`siswa_kelas`
WHERE `tb_siswa`.`siswa_id` = '1'