app/Models/TahunAjaranModel.php

    public function semester()
    {
        //one to many relationship semester_id and tahun_ajaran_id
        $builder = $this->db->table('tb_semester');
        $builder->select('tb_semester.semester_id, tb_semester.nama, tb_semester.tahun_ajaran_id, tb_tahun_ajaran.nama');
        $builder->join('tb_tahun_ajaran', 'tb_semester.tahun_ajaran_id = tb_tahun_ajaran.tahun_ajaran_id');
        $query = $builder->get();
---
SELECT `tb_semester`.`semester_id`, `tb_semester`.`nama`, `tb_semester`.`tahun_ajaran_id`, `tb_tahun_ajaran`.`nama`
FROM `tb_semester`
JOIN `tb_tahun_ajaran` ON `tb_semester`.`tahun_ajaran_id` = `tb_tahun_ajaran`.`tahun_ajaran_id`